app/controllers/wish_lists_controller.rb

   def index
    @from_mail_user = User.find(params[:user_id]) if params[:user_id]  # when user click on mail link
    @facebook_user = facebook_user
    @wish_lists =  WishList.find(:all, :conditions => { :user_id => user.id })
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`facebook_id` = 100000286056578) LIMIT 1
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`user_id` = 2)

  def show
    @wish_list = WishList.find(params[:id],:include => [:categories]) rescue nil
---
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 38)
SELECT `categories`.* FROM `categories` INNER JOIN `category_wish_lists` ON `categories`.id = `category_wish_lists`.category_id WHERE ((`category_wish_lists`.wish_list_id = 4)) ORDER BY created_at DESC
SELECT `category_wish_lists`.* FROM `category_wish_lists` WHERE (`category_wish_lists`.wish_list_id = 4)

  def edit
    @wish_list = WishList.find(params[:id],:include =>[:categories, :category_wish_lists])
    @current_user = user
    @wishlist_items = @wish_list.category_wish_lists.find(:all,:order => 'created_at DESC').map{|c| c.category_id } rescue nil
    @parent = Category.find_all_by_parent_id(nil)
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 1) ORDER BY name
SELECT * FROM `category_wish_lists` WHERE (`category_wish_lists`.`wish_list_id` = 3 AND `category_wish_lists`.`category_id` = 1) LIMIT 1
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 2)
SELECT * FROM `categories` WHERE (`categories`.`parent_id` IS NULL)

  def create
    @facebook_user = facebook_user
    @wish_list = WishList.new(params[:wish_list])
    @wish_list.user = user

    if @wish_list.save
---
INSERT INTO `wish_lists` (`name`, `updated_at`, `facebook_id`, `category_id`, `description`, `user_id`, `created_at`) VALUES('mywishlist', '2010-04-16 09:28:35', NULL, NULL, 'mywishlist', 3, '2010-04-16 09:28:35')

  def update
    @wish_list = WishList.find(params[:id])
    if @wish_list.update_attributes(params[:wish_list])
       CategoryWishList.delete_all(["wish_list_id = ?", @wish_list.id]) # delete CategoryWishList all records of wish_list using single step
       unless params[:categories].blank?
         params[:categories].each do |category_id|
           CategoryWishList.create({ :category_id => category_id ,:wish_list_id => @wish_list.id , :custom_description => params["category_#{category_id}_custom_description"] })
---
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 3)
DELETE FROM `category_wish_lists` WHERE (wish_list_id = 3)
INSERT INTO `category_wish_lists` (`updated_at`, `custom_description`, `wish_list_id`, `category_id`, `created_at`) VALUES('2010-04-16 09:33:44', 'i want yellow rose', 3, 1, '2010-04-16 09:33:44')

  def destroy
    @wish_list = WishList.find(params[:id])
    @wish_list.destroy
---
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 27)
DELETE FROM `wish_lists` WHERE `id` = 27

  def publish_to_friends
    @wish_list = WishList.find(params[:id])
    @category = Category.find(params[:category])
---
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 2)
SELECT * FROM `categories` WHERE (`categories`.`id` = 5)