app/controllers/wish_lists_controller.rb

  def show
    @from_mail_user = User.find(params[:user_id]) if params[:user_id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def publish
    @wish_list = WishList.find(params[:id])
---
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 2)